/* --------------------------------------------------------------------- */
/* Variables                                                             */
/* --------------------------------------------------------------------- */


let admin;
let name;
name = "John";
admin = name;

let planetWeLive = 'earth';
let connectingUserName;

/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// - 갯수 별 상품 가격 계산하기
// - 구매 제품 가격의 총 합
// - 1년 기준 일(day)자 수
// - 구매 결제 여부
// - 구매 결제 내역
// - 브랜드 접두사
// - 오늘의 운세
// - 상품 정보


/* variables ----------------------------------------------------------- */

갯수 별 상품 가격 계산하기
let productName = '값';
상품의 가격은 변수로 놓아서 가격의 변화 적용

구매 제품 가격의 총 합
let totalPrice;

구매 결제 여부
let isPayment;
let hasClassName;

구매 결제 내역
오늘의 운세
상품 정보

/* constant variables -------------------------------------------------- */
1년 기준 일자 수
const DAYS_PER_YEAR = 365;
브랜드 접두사
const BRAND_PREFIX = 'DG';

/* -------------------------------------------------------------------------- */
/*                             Lexical Environment                            */
/* -------------------------------------------------------------------------- */

